{
  "citations" : [ {
    "textCitation" : "[See ax-13 on Metamath](http://us.metamath.org/mpegif/ax-13.html)"
  } ],
  "names" : [ "ax-13" ],
  "language" : "METAMATH_SET_MM",
  "lookupTerms" : [ "#T_wn", "#T_vx", "#T_wceq", "#T_vy", "#T_wi", "#T_vy", "#T_wceq", "#T_vz", "#T_wi", "#T_wal", "#T_vx", "#T_vy", "#T_wceq", "#T_vz" ],
  "metaLanguage" : "METAMATH",
  "remarks" : " Axiom of Quantified Equality.  One of the equality and substitution axioms of predicate calculus with equality. An equivalent way to express this axiom that may be easier to understand is ` ( -. x = y -> ( -. x = z -> ( y = z -> A. x y = z ) ) ) ` (see ~ ax13b ).  Recall that in the intended interpretation, our variables are metavariables ranging over the variables of predicate calculus (the object language).  In order for the first antecedent ` -. x = y ` to hold, ` x ` and ` y ` must have different values and thus cannot be the same object-language variable (so they are effectively \"distinct variables\" even though no $d is present).  Similarly, ` x ` and ` z ` cannot be the same object-language variable.  Therefore, ` x ` will not occur in the wff ` y = z ` when the first two antecedents hold, so analogous to ~ ax-5 , the conclusion ` ( y = z -> A. x y = z ) ` follows.  Note that ~ ax-5 cannot prove this directly because it requires $d statements. The original version of this axiom was ~ ax-c9 and was replaced with this shorter ~ ax-13 in December 2015.  The old axiom is proved from this one as theorem ~ axc9 .  Conversely, this axiom is proved from ~ ax-c9 as theorem ~ ax13 . The primary purpose of this axiom is to provide a way to introduce the quantifier ` A. x ` on ` y = z ` even when ` x ` and ` y ` are substituted with the same variable.  In this case, the first antecedent becomes ` -. x = x ` and the axiom still holds. Although this version is shorter, the original version ~ axc9 may be more practical to work with because of the \"distinctor\" form of its antecedents.  A typical application of ~ axc9 is in ~ dvelimh which converts a distinct variable pair to the distinctor antecedent ` -. A. x x = y ` .  In particular, it is conjectured that it is not possible to prove ~ ax6 from ~ ax6v without this axiom. This axiom can be weakened if desired by adding distinct variable restrictions on pairs ` x , z ` and ` y , z ` .  To show that, we add these restrictions to theorem ~ ax13v and use only ~ ax13v for further derivations.  Thus, ~ ax13v should be the only theorem referencing this axiom.  Other theorems can reference either ~ ax13v (preferred) or ~ ax13 . This axiom scheme is logically redundant (see ~ ax13w ) but is used as an auxiliary axiom to achieve metalogical completeness (i.e. so that all possible cases of bundling can be proved; see text linked at ~ mmtheorems.html#wal ).  It is not known whether this axiom can be derived from the others.  (Contributed by NM, 21-Dec-2015.) (New usage is discouraged.) ",
  "statement" : "ax-13 $p |- ( -. x = y -> ( y = z -> A. x y = z ) ) $."
}