{
  "citations" : [ {
    "textCitation" : "[See ax-ac on Metamath](http://us.metamath.org/mpegif/ax-ac.html)"
  } ],
  "names" : [ "ax-ac" ],
  "language" : "METAMATH_SET_MM",
  "lookupTerms" : [ "#T_wex", "#T_vy", "#T_wal", "#T_vz", "#T_wal", "#T_vw", "#T_vz", "#T_wcel", "#T_vw", "#T_wa", "#T_vw", "#T_wcel", "#T_vx", "#T_wi", "#T_wex", "#T_vv", "#T_wal", "#T_vu", "#T_wex", "#T_vt", "#T_vu", "#T_wcel", "#T_vw", "#T_wa", "#T_vw", "#T_wcel", "#T_vt", "#T_wa", "#T_vu", "#T_wcel", "#T_vt", "#T_wa", "#T_vt", "#T_wcel", "#T_vy", "#T_wb", "#T_vu", "#T_wceq", "#T_vv", "#T_vt", "#T_vu", "#T_vv", "#T_vw", "#T_vx", "#T_vy", "#T_vz" ],
  "metaLanguage" : "METAMATH",
  "remarks" : " Axiom of Choice.  The Axiom of Choice (AC) is usually considered an extension of ZF set theory rather than a proper part of it.  It is sometimes considered philosophically controversial because it asserts the existence of a set without telling us what the set is.  ZF set theory that includes AC is called ZFC. The unpublished version given here says that given any set ` x ` , there exists a ` y ` that is a collection of unordered pairs, one pair for each nonempty member of ` x ` .  One entry in the pair is the member of ` x ` , and the other entry is some arbitrary member of that member of ` x ` .  See the rewritten version ~ ac3 for a more detailed explanation.  Theorem ~ ac2 shows an equivalent written compactly with restricted quantifiers. This version was specifically crafted to be short when expanded to primitives.  Kurt Maes' 5-quantifier version ~ ackm is slightly shorter when the biconditional of ~ ax-ac is expanded into implication and negation.  In ~ axac3 we allow the constant ` CHOICE ` to represent the Axiom of Choice; this simplifies the representation of theorems like ~ gchac (the Generalized Continuum Hypothesis implies the Axiom of Choice). Standard textbook versions of AC are derived as ~ ac8 , ~ ac5 , and ~ ac7 .  The Axiom of Regularity ~ ax-reg (among others) is used to derive our version from the standard ones; this reverse derivation is shown as theorem ~ dfac2 .  Equivalents to AC are the well-ordering theorem ~ weth and Zorn's lemma ~ zorn .  See ~ ac4 for comments about stronger versions of AC. In order to avoid uses of ~ ax-reg for derivation of AC equivalents, we provide ~ ax-ac2 (due to Kurt Maes), which is equivalent to the standard AC of textbooks.  The derivation of ~ ax-ac2 from ~ ax-ac is shown by theorem ~ axac2 , and the reverse derivation by ~ axac .  Therefore, new proofs should normally use ~ ax-ac2 instead. (New usage is discouraged.)  (Contributed by NM, 18-Jul-1996.) ",
  "statement" : "ax-ac $p |- E. y A. z A. w ( ( z e. w /\\ w e. x ) -> E. v A. u ( E. t ( ( u e. w /\\ w e. t ) /\\ ( u e. t /\\ t e. y ) ) <-> u = v ) ) $.\n$d t u v w x y z $."
}