{
  "citations" : [ {
    "textCitation" : "[See df-frec on Metamath](http://us.metamath.org/mpegif/df-frec.html)"
  } ],
  "names" : [ "df-frec" ],
  "language" : "METAMATH_SET_MM",
  "lookupTerms" : [ "#T_cfrec--1", "#T_cF", "#T_cfrec--2", "#T_cI", "#T_wceq", "#T_crecs", "#T_vg", "#T_cmpt--1", "#T_cvv", "#T_cmpt--2", "#T_cab--1", "#T_vx", "#T_cab--2", "#T_wrex--1", "#T_vm", "#T_wrex--2", "#T_com", "#T_cdm", "#T_vg", "#T_wceq", "#T_csuc", "#T_vm", "#T_wa", "#T_vx", "#T_wcel", "#T_cF", "#T_cfv", "#T_vg", "#T_cfv", "#T_vm", "#T_wo", "#T_cdm", "#T_vg", "#T_wceq", "#T_c0", "#T_wa", "#T_vx", "#T_wcel", "#T_cI", "#T_cab--3", "#T_cres", "#T_com", "#T_cF", "#T_vg", "#T_vm", "#T_vx", "#T_cI", "#T_vg", "#T_vm", "#T_vx" ],
  "metaLanguage" : "METAMATH",
  "remarks" : " Define a recursive definition generator on ` _om ` (the class of finite ordinals) with characteristic function ` F ` and initial value ` I ` . This rather amazing operation allows us to define, with compact direct definitions, functions that are usually defined in textbooks only with indirect self-referencing recursive definitions.  A recursive definition requires advanced metalogic to justify - in particular, eliminating a recursive definition is very difficult and often not even shown in textbooks.  On the other hand, the elimination of a direct definition is a matter of simple mechanical substitution.  The price paid is the daunting complexity of our ` frec ` operation (especially when ~ df-recs that it is built on is also eliminated).  But once we get past this hurdle, definitions that would otherwise be recursive become relatively simple; see ~ frec0g and ~ frecsuc . Unlike with transfinite recursion, finite recurson can readily divide definitions and proofs into zero and successor cases, because even without excluded middle we have theorems such as ~ nn0suc .  The analogous situation with transfinite recursion - being able to say that an ordinal is zero, successor, or limit - is enabled by excluded middle and thus is not available to us.  For the characteristic functions which satisfy the conditions given at ~ frecrdg , this definition and ~ df-irdg restricted to ` _om ` produce the same result. _Note:  We introduce_ ` frec ` _with the philosophical goal of being_ _able to eliminate all definitions with direct mechanical substitution_ _and to verify easily the soundness of definitions.  Metamath itself_ _has no built-in technical limitation that prevents multiple-part_ _recursive definitions in the traditional textbook style_.  (Contributed by Mario Carneiro and Jim Kingdon, 10-Aug-2019.) ",
  "statement" : "df-frec $p |- frec ( F , I ) = ( recs ( ( g e. _V |-> { x | ( E. m e. _om ( dom g = suc m /\\ x e. ( F ` ( g ` m ) ) ) \\/ ( dom g = (/) /\\ x e. I ) ) } ) ) |` _om ) $.\n$d F g m x $.\n$d I g m x $."
}