{
  "citations" : [ {
    "textCitation" : "[See fin23 on Metamath](http://us.metamath.org/mpegif/fin23.html)"
  } ],
  "names" : [ "fin23" ],
  "language" : "METAMATH_SET_MM",
  "lookupTerms" : [ "#T_cA", "#T_wcel", "#T_cfin2", "#T_wi", "#T_cA", "#T_wcel", "#T_cfin3" ],
  "metaLanguage" : "METAMATH",
  "remarks" : " Every II-finite set (every chain of subsets has a maximal element) is III-finite (has no denumerable collection of subsets).  The proof here is the only one I could find, from ~ http://matwbn.icm.edu.pl/ksiazki/fm/fm6/fm619.pdf p.94 (writeup by Tarski, credited to Kuratowski).  Translated into English and modern notation, the proof proceeds as follows (variables renamed for uniqueness): Suppose for a contradiction that ` A ` is a set which is II-finite but not III-finite. For any countable sequence of distinct subsets ` T ` of ` A ` , we can form a decreasing sequence of nonempty subsets ` ( U `` T ) ` by taking finite intersections of initial segments of ` T ` while skipping over any element of ` T ` which would cause the intersection to be empty. By II-finiteness (as ~ fin2i2 ) this sequence contains its intersection, call it ` Y ` ; since by induction every subset in the sequence ` U ` is nonempty, the intersection must be nonempty. Suppose that an element ` X ` of ` T ` has nonempty intersection with ` Y ` .  Thus, said element has a nonempty intersection with the corresponding element of ` U ` , therefore it was used in the construction of ` U ` and all further elements of ` U ` are subsets of ` X ` , thus ` X ` contains the ` Y ` .  That is, all elements of ` X ` either contain ` Y ` or are disjoint from it. Since there are only two cases, there must exist an infinite subset of ` T ` which uniformly either contain ` Y ` or are disjoint from it.  In the former case we can create an infinite set by subtracting ` Y ` from each element.  In either case, call the result ` Z ` ; this is an infinite set of subsets of ` A ` , each of which is disjoint from ` Y ` and contained in the union of ` T ` ; the union of ` Z ` is strictly contained in the union of ` T ` , because only the latter is a superset of the nonempty set ` Y ` . The preceding four steps may be iterated a countable number of times starting from the assumed denumerable set of subsets to produce a denumerable sequence ` B ` of the ` T ` sets from each stage.  Great caution is required to avoid ~ ax-dc here; in particular an effective version of the pigeonhole principle (for aleph-null pigeons and 2 holes) is required.  Since a denumerable set of subsets is assumed to exist, we can conclude ` _om e. _V ` without the axiom. This ` B ` sequence is strictly decreasing, thus it has no minimum, contradicting the first assumption.  (Contributed by Stefan O'Rear, 2-Nov-2014.)  (Proof shortened by Mario Carneiro, 17-May-2015.) ",
  "statement" : "fin23 $p |- ( A e. Fin2 -> A e. Fin3 ) $."
}