{
  "contributor": {
    "handle": "abc"
  },
  "title": "Metamath Home page",
  "authors": [
    {
      "user": {
        "handle": "abc"
      }
    }
  ],
  "abstractText": "Metamath Home page",
  "beliefset": "#metamath/B.default",
  "content": "[Metamath](https://us.metamath.org) is a formal language that can express theorems in abstract mathematics, accompanied by proofs that can be verified by a computer program. This allows you to see mathematics developed in complete detail from first principles, with absolute rigor. Inspired by Whitehead and Russell's monumental Principia Mathematica, the Metamath community has produced tens of thousands of completely worked out proofs, starting from the very foundation that mathematics is built on and eventually arriving at familiar mathematical facts and beyond. \n\n## Formal System\nWe have incorporated all knowledge from Metamath's `set.mm` database, which is perhaps the World's largest database of formal proofs. This highlights our ability to manage, present, and verify formal systems at scale. Sophize can bring all formal systems under one roof, highlight relationships between them, and make careful comparisons of the formulations of theorems in various contexts. Here are a few famous theorems formalized with Metamath:\n\n> - #P_sqrt2irr\n> - #P_pnt\n> - #P_ramsey\n> - #P_lhop\n> - #P_birthday\n> - #P_1arith2\n\nSince Metamath is a fully formal language, each theorem and definition is parsed so that you can click on any of its components and see their meaning. For example, try clicking on various terms of the Prime number theorem below:\n\n> #P_pnt|EXPAND\n\n### Smart articles\nInformal texts - like books and research papers - are easier to read and understand. Formal databases - like Mizar, Metamath, Lean - are fully detailed, and their proofs are beyond reproach. Smart articles bring the best of these two worlds together - to help users quickly understand the content and also scrutinize every last detail when they need to. Take a look at the following smart article to see this in action:\n\n<b>#R_prime_number|NAV_LINK</b>\n\n## Compute Capabilities\nSophize doesn't merely show existing theorems and their proofs. Sophize provides its users the ability to write proof-generating code in the language of their choice. We manage all the server, database, communication, and frontend work so that you can focus on what you love - Mathematics. Take a look a the following proof-generating machine, that generates fully formal proofs of primality of numbers:\n\n> <b>#M_prime_number|NAV_LINK</b>\n"
}